---
kind: type
id: T:Autodesk.Revit.DB.KeyBasedTreeEntries
source: html/554c9024-27de-0649-7078-c778cd92be5f.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntries

A collection of KeyBasedTreeEntry objects that make up the key-based tree.

## Syntax (C#)
```csharp
public class KeyBasedTreeEntries : IEnumerable<KeyBasedTreeEntry>,
	IDisposable
```